liudr/micropython/ports/esp32/boards/PINNACLE_SPIRAM/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Pinnacle ESP32 module (spiram)"
#define MICROPY_HW_MCU_NAME "ESP32"
